In [12]:
import pandas as pd
import numpy as np

In [2]:
data_url = "https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data"
df_data = pd.read_csv(data_url, sep="\s+", header=None)

In [3]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [4]:
df_data.columns = [
    "CRIM",
    "ZN",
    "INDUS",
    "CHAS",
    "NOX",
    "RM",
    "AGE",
    "DIS",
    "RAD",
    "TAX",
    "PTRATIO",
    "B",
    "LSTAT",
    "MEDV",
]
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [5]:
df_data.values

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 3.9690e+02, 4.9800e+00,
        2.4000e+01],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 3.9690e+02, 9.1400e+00,
        2.1600e+01],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 3.9283e+02, 4.0300e+00,
        3.4700e+01],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 5.6400e+00,
        2.3900e+01],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 3.9345e+02, 6.4800e+00,
        2.2000e+01],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 7.8800e+00,
        1.1900e+01]])

In [7]:
type(df_data.values)

numpy.ndarray

In [9]:
# series
list_data = [1,2,3,4,5]
example_obj = pd.Series(data=list_data)
example_obj, type(example_obj)

(0    1
 1    2
 2    3
 3    4
 4    5
 dtype: int64,
 pandas.core.series.Series)

In [13]:
list_data = [1,2,3,4,5]
list_name = ["a","b","c","d","e"]
example_obj = pd.Series(data=list_data, index=list_name)
example_obj, type(example_obj)

(a    1
 b    2
 c    3
 d    4
 e    5
 dtype: int64,
 pandas.core.series.Series)

In [14]:
dict_data = {"a":1,"b":2,"c":3,"d":4,"e":5}
example_obj = pd.Series(data=dict_data, dtype=np.float32, name="example_data")
example_obj, type(example_obj)

(a    1.0
 b    2.0
 c    3.0
 d    4.0
 e    5.0
 Name: example_data, dtype: float32,
 pandas.core.series.Series)

In [15]:
example_obj["a"]

1.0

In [16]:
example_obj["a"] = 3.2
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [17]:
example_obj = example_obj.astype(int)
example_obj

a    3
b    2
c    3
d    4
e    5
Name: example_data, dtype: int32

In [18]:
example_obj.name = "number"
example_obj.index.name = "alphabet"
example_obj

alphabet
a    3
b    2
c    3
d    4
e    5
Name: number, dtype: int32

In [19]:
# index 기준으로 series 생성
dict_data = {"a":1,"b":2,"c":3,"d":4,"e":5}
indexes = ["a","b","c","d","e","f","g","h"]
series_obj_1 = pd.Series(dict_data, index=indexes)
series_obj_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [30]:
# DataFrame
raw_data = {'first_name':['Jason', 'Molly', 'lina', 'jake', 'Amy'],
            'last_name':['Milier', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age':[42, 52, 36, 24, 73],
            'city':['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns=['first_name', 'last_name', 'age', 'city', 'debt'])
df

  first_name last_name  age           city debt
0      Jason    Milier   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       lina       Ali   36          Miami  NaN
3       jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [21]:
df.first_name

0    Jason
1    Molly
2     lina
3     jake
4      Amy
Name: first_name, dtype: object

In [22]:
df['first_name']

0    Jason
1    Molly
2     lina
3     jake
4      Amy
Name: first_name, dtype: object

In [23]:
# indexing
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
Name: 1, dtype: object

In [24]:
df['age'].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [25]:
s = pd.Series(np.nan, index=[49, 48, 47, 46, 45, 1, 2, 3, 4, 5])
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [26]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [27]:
df.loc[:, ['first_name', 'last_name']]

  first_name last_name
0      Jason    Milier
1      Molly  Jacobson
2       lina       Ali
3       jake    Milner
4        Amy     Cooze

In [28]:
df['age'].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [29]:
df.age > 40

0     True
1     True
2    False
3    False
4     True
Name: age, dtype: bool

In [32]:
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Milier   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       lina       Ali   36          Miami  False
3       jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [33]:
values = pd.Series(data=["M", "F", "F"], index=[0,1,3])
values

0    M
1    F
3    F
dtype: object

In [34]:
df["sex"] = values
df

  first_name last_name  age           city   debt  sex
0      Jason    Milier   42  San Francisco   True    M
1      Molly  Jacobson   52      Baltimore   True    F
2       lina       Ali   36          Miami  False  NaN
3       jake    Milner   24        Douglas  False    F
4        Amy     Cooze   73         Boston   True  NaN

In [35]:
df.head(3).T

                        0          1      2
first_name          Jason      Molly   lina
last_name          Milier   Jacobson    Ali
age                    42         52     36
city        San Francisco  Baltimore  Miami
debt                 True       True  False
sex                     M          F    NaN

In [36]:
df.values

array([['Jason', 'Milier', 42, 'San Francisco', True, 'M'],
       ['Molly', 'Jacobson', 52, 'Baltimore', True, 'F'],
       ['lina', 'Ali', 36, 'Miami', False, nan],
       ['jake', 'Milner', 24, 'Douglas', False, 'F'],
       ['Amy', 'Cooze', 73, 'Boston', True, nan]], dtype=object)

In [37]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
df.to_csv()

',first_name,last_name,age,city,debt,sex\r\n0,Jason,Milier,42,San Francisco,True,M\r\n1,Molly,Jacobson,52,Baltimore,True,F\r\n2,lina,Ali,36,Miami,False,\r\n3,jake,Milner,24,Douglas,False,F\r\n4,Amy,Cooze,73,Boston,True,\r\n'

In [39]:
df

  first_name last_name  age           city   debt  sex
0      Jason    Milier   42  San Francisco   True    M
1      Molly  Jacobson   52      Baltimore   True    F
2       lina       Ali   36          Miami  False  NaN
3       jake    Milner   24        Douglas  False    F
4        Amy     Cooze   73         Boston   True  NaN

In [40]:
df.drop("debt", axis=1)
del df["debt"]

In [41]:
df

  first_name last_name  age           city  sex
0      Jason    Milier   42  San Francisco    M
1      Molly  Jacobson   52      Baltimore    F
2       lina       Ali   36          Miami  NaN
3       jake    Milner   24        Douglas    F
4        Amy     Cooze   73         Boston  NaN

In [43]:
# example from python for data analyis

pop = {"Nevada": {2001:2.4, 2002:2.9}, "Ohio": {2000:1.5, 2001:1.7, 2002:3.6}}
pd.DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5